<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2017/4/10
 * Time: 11:40
 */

namespace Semsearch;


class SearchType
{
    /**
     * @var int 百度推广
     */
    const BAIDU = 1;

    /**
     * @var int 360点睛推广
     */
    const SANLIULING = 2;

    /**
     * @var int 神马卧龙推广
     */
    const SHENMA = 3;

    /**
     * @var string 搜狗
     */
    const SOGOU = 4;
    /**
     * @var array 百度错误码
     */
    static function getBAIDUMsgDic(){
        return  array(
            8101 => '缺少用户名信息',
            8102 => '用户名不合法',
            8103 => '用户名不合法',
            8104 => '没有权限操作该用户',
            8201 => '缺少密码信息',
            8202 => '密码不合法',
            8401 => '缺少token信息',
            8402 => 'token不合法',
            8403 => 'token已删除',
            8501 => '配额不足',
            9012 => '没有操作该用户的权限',
            9013 => '系统错误',
            9013001 => '后端服务异常',
            9013002 => '后端服务超时',
            9013003 => '后端业务错误',
            9013004 => '系统错误，建议再次重试',
            9014 => '请求的对象为空',
            9015 => '请求的对象中包含空元素',
            9016 => '该用户为未签约用户',
            9019 => '请求的数据容量超过系统上限',
            901910 => '媒体系统内部错误',
            901911 => '请求的数据过多，请调整数据后，重新发送报告请求',
            901912 => '请求处理超时，建议重发请求或者调整参数后重发请求',
            901913 => '用户没有权限查看报告',
            901914 => '用户没有权限查看展现数据',
            901924 => '请求的统计数据项performanceData取值不在系统定义的合法范围内',
            9011040 => '报告正在生成中',
            901918 => '媒体系统错误，请稍后再试',
            901919 => '请求处理超时，建议重发请求或者调整参数后重发请求',
        );
    }

    /**
     * 360错误码
     */
    static function getSANLIULINGMsgDic(){
        return  array(
            10000 => '操作全部成功',
            10001 => '操作部分成功',
            10002 => '操作全部失败',
            20101 => '缺少必要的参数-排除ip',
            20102 => '排除ip数量太多',
            20201 => '缺少必要的参数-账户预算',
            20301 => '更新频率过高',
            20302 => '账户预算格式不对',
            20501 => '账户预算值小于系统的最小限制（10)',
            20502 => '账户预算低于系统下限',
            20601 => 'Appid不存在',
            70001 => '登录次数太多',
            70002 => '登录失败，账户名密码错误或者账户被锁',
            70003 => '登录失败，需通过手机验证登录',
            70101 => '报表查询时间超上限',
            70102 => '报表查询时间为空',
            70103 => '报表查询级别有误',
            70104 => '报表查询id为空',
            70109 => '前一天的报表还未生成',
            80101 => '广告账户不存在',
            80102 => 'access Token不合法',
            80103 => 'api key不合法',
            80201 => '激活失败',
            80202 => '激活码失效',
            80401 => '拉取物料次数超过最大限度每天50次',
            80402 => '请求太过频繁，等待30s后重试',
            90001 => '未知服务器错误，如果遇到此错误且稳定复现，请保留请求包向官方反馈',
            90002 => '系统繁忙',
            90003 => 'No permission to access user data',
            90004 => 'No permission to access data for this referer',
            90005 => '360系统数据库错误',
            90006 => 'Invalid/Used call_id parameter',
            90007 => 'Incorrect signature',
            90008 => 'Too many parameters',
            90009 => 'Unsupported signature method',
            90010 => 'Invalid user info field',
            90011 => 'Invalid user id',
            90012 => '请求时间戳错误',
            90101 => '未知请求，请查看是否调用了错误的方法',
            90103 => '任务失败',
            90201 => '参数错误',
            90202 => 'ID为空',
            90203 => '一次请求操作的对象太多',
            90204 => '用户名重复',
            90301 => '请求来源IP非法（IP被封禁）',
            90401 => '配额不足',
            90601 => 'HTTP GET/POST方法选择错误',

        );
    }
    /**
     * 神马错误码
     */
    static function getSHENMAMsgDic(){
        return array(
            800 => '系统错误',
            8002 => 'Json message不合法',
            801 => '过于频繁的使用错误的用户名、密码或者token发送请求',
            802 => '过于频繁的使用错误的密码发送请求',
            805 => '权限错误（具体错误信息可能各异）',
            8101 => '缺少用户名信息',
            8102 => '用户名不合法',
            8104 => '该用户没有登录卧龙平台的权限',
            8201 => '缺少密码信息',
            8202 => '密码不合法',
            8301 => '被操作的目标用户名不合法',
            8303 => '被操作的目标用户没有登录卧龙平台的权限',
            8401 => '缺少token信息',
            8402 => 'token不合法，如需帮助请联系客服顾问',
            8403 => 'token已删除，如需帮助请联系客服顾问',
            8404 => '该用户没有申请卧龙搜索推广API服务',
            8406 => '该用户没有权限使用卧龙搜索推广API服务',
            8408 => '没有权限使用该token',
            8409 => '没有权限操作该目标用户',
            8411 => '没有权限操作其他用户',
            8501 => '配额不足',
            8502 => 'QPS请求超限',
            8503 => '并发请求超限',
            8603 => '请求头信息为空或不合法',
            9014 => '请求的对象为空',
            9016 => '该用户为未签约用户',
            901110 => '更新账户时，输入非法 userId 参数',
            901111 => '更新账户时，输入非法 balance 参数',
            901112 => '更新账户时，输入非法 cost 参数',
            901113 => '更新账户时，输入非法 payment 参数',
            901114 => '更新账户时，输入非法 opendomains 参数',
            901115 => '更新账户时，输入非法 regdomain 参数',
            901117 => '更新账户时，输入非法 weeklybudget 参数',
            901118 => '更新账户时，输入非法 userstat 参数',
            901132 => '账户 IP 排除数组中包含空值',
            901133 => '账户 IP 排除数量超过最大限制 30 个',
            901134 => '账户 IP 排除的输入值有误',
            901913 => '用户没有权限查看报告',
            901915 => '报表 ID 不合法',
            901921 => '报告类型非法',

        );
    }

    /**
     * 搜狗错误码
     */
    static function getSOGOUMsgDic(){
        return array(
            1 => '用户Id不存在',
            3 => '系统错误',
            4 => '参数为空',
            6 => '无效的用户名',
            8 => '密码错误',
            10 => '无效的token',
            18 => '配额不足',
            20 => '请求头无效，一般为soapheader设置authheader格式不正确',
            22 => '请求头里缺少代理商密码',
            23 => '无效的代理商用户名',
            24 => '代理商密码错误',
            25 => '您不是API用户',
            26 => '该IP已经被封禁',
            30 => '用户状态无效，请联系搜狗客服',
            1025001 => '报告类型错误',
            1025002 => '报告统计范围有错',
            1025003 => '报告统计时间单位有错',
            1025004	=> '报告绩效数据为空',
            1025005	=> '报告绩效数据有错',
            1025006 => '报告运行时异常',
            1025007 => '报告类型跟报告统计范围不匹配',
            1025008	=> '查询报告的 ReportID 无效',
            1025009	=> '查询报告没有数据',
            1025010	=> '报告还未生成',
            1028001	=> '报表系统忙，请稍后再试',
            1028003	=> '相同请求的任务正在运行中',
        );
    }

}